module.exports = {
    app      : {
        lang      : 'ru',
        stylus    : {
            theme_color : '#3E50B4'
        },
        GA        : false, // Google Analytics site's ID
        package   : 'ключ перезаписывается значениями из package.json marmelad-сборщика',
        settings  : 'ключ перезаписывается значениями из файла настроек settings.marmelad.js',
        storage   : 'ключ перезаписывается значениями из файла настроек settings.marmelad.js',
        buildTime : '',
        controls : [
            'default',
            'brand',
            'success',
            'info',
            'warning',
            'danger'
        ]
    },
    pageTitle: 'marmelad',
    reports : [
        {
            texts: [
                {
                    tag: 'h1',
                    title : 'Электронная сигарета и гарь , или что делать когда VAPE отдает гарью?',
                    text : '',
                }
            ],
            table : {
                mod : '',
                list: [
                    {
                        name : '',
                        list : [
                            {
                                bg : "F8ED9B",
                                name : 'электронная сигарета',
                                stat : '5 000',
                                bg2: "C4F3C6",
                            },
                            {
                                bg : "F8C89C",
                                name : 'гарь в электронной сигарете',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                        ],
                        list2 : [
                            {
                                name : 'электронная сигарета',
                                stat : '5 000',
                            },
                            {
                                name : 'гарь в электронной сигарете',
                                stat : '',
                            }
                        ]
                    }
                ]  
            } 
        },
        {
            texts: [
                {
                    tag: 'h1',
                    title : 'Электронная сигарета и гарь , или что делать когда VAPE отдает гарью?',
                    text : 'В Петербурге мало зелени, зато много воды и неба. Город раскинулся на равнине, и небо над ним необъятно. Можно подолгу наслаждаться спектаклями, которые на этой сцене разыгрывают облака и закаты. Актерами управляет лучший на свете режиссер – ветер. Декорации из крыш, куполов и шпилей остаются неизменными, но никогда не надоедают.',
                },
                 {
                    tag: 'h2',
                    title : 'Электронная сигарета и гарь , или что делать когда VAPE отдает гарью?',
                    text : 'В Петербурге мало зелени, зато много воды и неба. Город раскинулся на равнине, и небо над ним необъятно. Можно подолгу наслаждаться спектаклями, которые на этой сцене разыгрывают облака и закаты. Актерами управляет лучший на свете режиссер – ветер. Декорации из крыш, куполов и шпилей остаются неизменными, но никогда не надоедают.',
                },
                 {
                    tag: 'h2',
                    title : 'Электронная сигарета и гарь , или что делать когда VAPE отдает гарью?',
                    text : 'В Петербурге мало зелени, зато много воды и неба. Город раскинулся на равнине, и небо над ним необъятно. Можно подолгу наслаждаться спектаклями, которые на этой сцене разыгрывают облака и закаты. Актерами управляет лучший на свете режиссер – ветер. Декорации из крыш, куполов и шпилей остаются неизменными, но никогда не надоедают.',
                }
            ],
            table : {
                mod: '',
                list: [
                    {
                        name : 'Заголовка H1',
                        list : [
                            {
                                bg : "F8ED9B",
                                name : 'электронная сигарета',
                                stat : '5 000',
                                bg2: "C4F3C6",
                            }
                        ]
                    },
                    {
                        name : 'Заголовков H2-H3',
                        list : [
                            {
                                bg : "F8999C",
                                name : 'гарь в электронной сигарете',
                                stat : '5 000',
                                bg2: "C4F3C6",
                            },
                            {
                                bg : "F8C89C",
                                name : 'гарь в электронной сигарете',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                            {
                                bg : "A5FFE1",
                                name : 'гарь в электронной сигарете',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                        ]
                    },
                    {
                        name : 'Основного текста',
                        list : [
                            {
                                bg : "D1AC89",
                                name : 'гарь в электронной сигарете',
                                stat : '',
                                bg2: "C4F3C6",
                            },
                            {
                                bg : "DEDEDE",
                                name : 'электронный',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                            {
                                bg : "EB8AFF",
                                name : 'курение',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                            {
                                bg : "A7C0FF",
                                name : 'гарь',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                            {
                                bg : "B1FF9A",
                                name : 'испаритель',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                        ],
                        list2 : [
                            {
                                name : 'электронная сигарета',
                                stat : '5 000',
                            },
                            {
                                name : 'гарь в электронной сигарете',
                                stat : '',
                            }
                        ]
                    }
                ] 
            }  
        },
        {
            texts: [
                 {
                    tag: 'h2',
                    title : 'Электронная сигарета и гарь , или что делать когда VAPE отдает гарью?',
                    text : 'В Петербурге мало зелени, зато много воды и неба. Город раскинулся на равнине, и небо над ним необъятно. Можно подолгу наслаждаться спектаклями, которые на этой сцене разыгрывают облака и закаты. Актерами управляет лучший на свете режиссер – ветер. Декорации из крыш, куполов и шпилей остаются неизменными, но никогда не надоедают.',
                }
            ],
            table : {
                mod : "",
                list : [
                    {
                        name : 'Заголовка H1',
                        list : [
                            {
                                bg : "F8ED9B",
                                name : 'электронная сигарета',
                                stat : '5 000',
                                bg2: "C4F3C6",
                            }
                        ]
                    },
                    {
                        name : 'Заголовков H2-H3',
                        list : [
                            {
                                bg : "F8999C",
                                name : 'гарь в электронной сигарете',
                                stat : '5 000',
                                bg2: "C4F3C6",
                            },
                            {
                                bg : "F8C89C",
                                name : 'гарь в электронной сигарете',
                                stat : '',
                                bg2: "F4C3C7",
                            },
                        ],
                        list2 : [
                            {
                                name : 'электронная сигарета',
                                stat : '5 000',
                            },
                            {
                                name : 'гарь в электронной сигарете',
                                stat : '',
                            }
                        ]
                    }
                ] 
            }  
        }
    ],
    tztable1 : {
        mod : "task",
        extra: true,
        input: true,
                list : [
                    {
                        name : 'Заголовка H1',
                        list : [
                            {
                                bg : "",
                                name : 'электронная сигарета',
                                stat : '5 000',
                                bg2: "",
                            }
                        ]
                    },
                ] 
    },
    tztable2 : {
        mod : "task",
        extra: true,
        input: true,
        list : [
            {
                name : 'Заголовков H2-H3',
                list : [
                    {
                        bg : "",
                        name : 'гарь в электронной сигарете',
                        stat : '5 000',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'гарь в электронной сигарете',
                        stat : '',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'гарь в электронной сигарете',
                        stat : '',
                        bg2: "",
                    }
                ]
            }
        ] 
    },
    tztable3 : {
        mod : "task",
        extra: true,
        input: true,
        list : [
            {
                name : '',
                list : [
                    {
                        bg : "",
                        name : 'сигарета',
                        stat : '5 000',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'электронный',
                        stat : '5 000',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'курение',
                        stat : '',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'испаритель',
                        stat : '',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'испаритель',
                        stat : '',
                        bg2: "",
                    }
                ],
                list2 : [
                    {
                        name : 'электронная сигарета',
                        stat : '5 000',
                    },
                    {
                        name : 'гарь в электронной сигарете',
                        stat : '',
                    }
                ]
            }
        ] 
    },
    tztable4 : {
        mod : "task min",
        extra: true,
        input: true,
        hideItem: true,
        list : [
            {
                name : '',
                list : [
                    {
                        bg : "",
                        name : 'сигарета',
                        stat : '',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'электронный',
                        stat : '',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'курение',
                        stat : '',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'испаритель',
                        stat : '',
                        bg2: "",
                    },
                    {
                        bg : "",
                        name : 'испаритель',
                        stat : '',
                        bg2: "",
                    }
                ]
            }
        ] 
    },
    checkText : [
        {
            title: 'Тип задания',
            text: 'новый текст'
        },
        {
            title: 'Назначение (URL)',
            text: 'статья на сайт в раздел  новости'
        },
        {
            title: 'Объем от',
            text: '<input type="text" value="2500" disabled="" name="size-amount1"><div class="b-task__item-text">до</div><input type="text" value="2700" disabled="" name="size-amount2"><div class="b-task__item-text">символов с пробелами</div>'
        },
        {
            title: 'Примечание',
            text: 'Статьи должны быть написаны простым и понятным языком, ведь это не книга и не журнал, в котором следует использовать заумные фразы и обороты речи. Чем проще Вы подадите информацию, чем больше людей её поймут, тем лучше. Поэтому мы не советуем использовать в своих статьях какие-либо сокращения, альтернативные названия, сленг и сложные термины. Если без этого не обойтись'
        },
        {
            title: 'Примеры',
            text: '<a href="#">http://vapes.guru/obsluzhivanie/elektronnaya-sigareta-gorchin-v-chem-prichina-i-chto-delat.html</a><a href="#">http://www.elbasio.ru/articles/chto-delat-esli-poshla-gar-na-elektronnoj-sigarete-gari-na-ektronn</a>'
        },
        {
            title: 'Структура',
            text: 'H1 Электронная сигарета и гарь , или что делать когда VAPE отдает гарью? <br>H2 Итак у вас появилась гарь в электронной сигарете. <br>H3 Cхема устройства испарителя атомайзера (бакомазера , клиромайзера) <br>H2 Выработанный ресурс фитиля /спирали электронной сигареты или боксмода. <br>H3 Недостаточная смачиваемость фитиля.  Смотреть видео как прочистить спирали (койлы) на английском с русскими субтитрами'
        }
    ],
    checkTable : {
        mod: '',
        crazy: true,
        list: [
            {
                name : 'Заголовка H1',
                list : [
                    {
                        class: 'request',
                        bg : "F8ED9B",
                        name : 'электронная сигарета',
                        stat : '5 000',
                        bg2: [
                            {title: '1', bg: 'green',},
                            {title: '1', bg: 'green',},
                            {title: '1', bg: 'green',},
                        ],
                    }
                ]
            },
            {
                name : 'Заголовков H2-H3',
                list : [
                    {
                        class: 'request',
                        bg : "F8999C",
                        name : 'гарь в электронной сигарете',
                        stat : '5 000',
                        bg2: [
                            {title: '1', bg: 'green',},
                            {title: '1', bg: '',},
                            {title: '1', bg: 'green',},
                        ],
                    },
                    {
                        class: 'request',
                        bg : "F8C89C",
                        name : 'гарь в электронной сигарете',
                        stat : '',
                        bg2: [
                            {title: '1', bg: 'red',},
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                        ],
                    },
                    {
                        class: 'request',
                        bg : "A5FFE1",
                        name : 'гарь в электронной сигарете',
                        stat : '',
                        bg2: [
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                        ],
                    },
                ]
            },
            {
                extra2 : true,
                name : 'Основного текста',
                list : [
                    {
                        class: 'request',
                        bg : "D1AC89",
                        name : 'гарь в электронной сигарете',
                        stat : '',
                        bg2: [
                            {title: '1', bg: 'green',},
                            {title: '1', bg: 'green',},
                            {title: '1', bg: '',},
                        ],
                    },
                    {
                        class: 'request',
                        bg : "DEDEDE",
                        name : 'электронный',
                        stat : '',
                        bg2: [
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                        ],
                    },
                    {
                        class: 'request',
                        bg : "EB8AFF",
                        name : 'курение',
                        stat : '',
                        bg2: [
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                        ],
                    },
                    {
                        class: 'request',
                        bg : "A7C0FF",
                        name : 'гарь',
                        stat : '',
                        bg2: [
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                        ],
                    },
                    {
                        class: 'request',
                        bg : "B1FF9A",
                        name : 'испаритель',
                        stat : '',
                        bg2: [
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                            {title: '1', bg: '',},
                        ],
                    },
                ]
            }
        ] 
    }
};